
import pandas as pd
import csv
f = open('包含結巴.csv')
df = pd.read_csv(f,header=None)
f2 = open('包含結巴(標題).csv')
df2 = pd.read_csv(f2,header=None)
df.drop_duplicates(subset=None, keep='first', inplace=False)
with open('jieba包含1.csv','w') as final:
    fieldnames = [
'洗衣機','熱水器','床墊','保潔墊','電磁爐','流理臺','冷氣',
'曬衣','陽台','床','衣櫃','衣櫥','光纖','網路','寬頻','磁卡','椅','桌','書櫃','沙發','警報',
'監視','滅火','監控','警衛','保全','第四臺','清掃','垃圾','公共區域','公用區域','公共空間',
'公用空間','資源回收','乾溼分離','烘乾機','除濕機','窗','獨立門戶','熱水壺','飲水機','電視',
'通風','採光','光線充足','梳妝台','車位','代收','頂加','鞋櫃','社會住宅','冰箱']
    writer = csv.DictWriter(final, fieldnames=fieldnames)
# 寫入第一列的欄位名稱
    writer.writeheader()
    for j in range(0,len(df)):#列
        a1=0;a2=0;a3=0;a4=0;a5=0;a6=0;a7=0;a8=0;a9=0;a10=0;a11=0;a12=0;a13=0;a14=0;a15=0;a16=0;a17=0;a18=0;a19=0;a20=0;a21=0;a22=0;a23=0;a24=0;a25=0;a26=0;a27=0;a28=0;a29=0;a30=0;a31=0;a32=0;a33=0;a34=0;a35=0;a36=0;a37=0;a38=0;a39=0;a40=0;a41=0;a42=0;a43=0;a44=0;a45=0;a46=0;a47=0;a48=0;a49=0;a50=0;a51=0;a52=1;
        for i in range(0,632): #行
            if (df[i][j]=='洗衣機'):
                a1=1    
            elif (df[i][j]=='熱水器'):
                a2=1
            elif (df[i][j]=='床墊'):
                a3=1
            elif (df[i][j]=='保潔墊'):
                a4=1
            elif (df[i][j]=='電磁爐'):
                a5=1
            elif (df[i][j]=='流理臺'):
                a6=1
            elif (df[i][j]=='冷氣'):
                a7=1
            elif (df[i][j]=='曬衣'):
                a8=1
            elif (df[i][j]=='陽台'):
                a9=1
            elif (df[i][j]=='床'):
                a10=1
            elif (df[i][j]=='衣櫃'):
                a11=1
            elif (df[i][j]=='衣櫥'):
                a12=1
            elif (df[i][j]=='光纖'):
                a13=1
            elif (df[i][j]=='網路'):
                a14=1
            elif (df[i][j]=='寬頻'):
                a15=1
            elif (df[i][j]=='磁卡'):
                a16=1
            elif (df[i][j]=='椅'):
                a17=1
            elif (df[i][j]=='桌'):
                a18=1
            elif (df[i][j]=='書櫃'):
                a19=1
            elif (df[i][j]=='沙發'):
                a20=1
            elif (df[i][j]=='警報'):
                a21=1
            elif (df[i][j]=='監視'):
                a22=1
            elif (df[i][j]=='滅火'):
                a23=1
            elif (df[i][j]=='監控'):
                a24=1
            elif (df[i][j]=='警衛'):
                a25=1
            elif (df[i][j]=='保全'):
                a26=1
            elif (df[i][j]=='第四臺'):
                a27=1
            elif (df[i][j]=='清掃'):
                a28=1
            elif (df[i][j]=='垃圾'):
                a29=1
            elif (df[i][j]=='公共區域'):
                a30=1
            elif (df[i][j]=='公用區域'):
                a31=1
            elif (df[i][j]=='公共空間'):
                a32=1
            elif (df[i][j]=='公用空間'):
                a33=1
            elif (df[i][j]=='資源回收'):
                a34=1
            elif (df[i][j]=='乾溼分離'):
                a35=1
            elif (df[i][j]=='烘乾機'):
                a36=1
            elif (df[i][j]=='除濕機'):
                a37=1
            elif (df[i][j]=='窗'):
                a38=1
            elif (df[i][j]=='獨立門戶'):
                a39=1
            elif (df[i][j]=='熱水壺'):
                a40=1
            elif (df[i][j]=='飲水機'):
                a41=1
            elif (df[i][j]=='電視'):
                a42=1
            elif (df[i][j]=='通風'):
                a43=1
            elif (df[i][j]=='採光'):
                a44=1
            elif (df[i][j]=='光線充足'):
                a45=1
            elif (df[i][j]=='梳妝台'):
                a46=1
            elif (df[i][j]=='車位'):
                a47=1
            elif (df[i][j]=='代收'):
                a48=1
            elif (df[i][j]=='頂加'):
                a49=0
            elif (df[i][j]=='鞋櫃'):
                a50=1
            elif (df[i][j]=='社會住宅'):
                a51=1
            elif (df[i][j]=='冰箱'):
                a52=1

        writer.writerow({'洗衣機':a1,
'熱水器':a2,
'床墊':a3,
'保潔墊':a4,
'電磁爐':a5,
'流理臺':a6,
'冷氣':a7,
'曬衣':a8,
'陽台':a9,
'床':a10,
'衣櫃':a11,
'衣櫥':a12,
'光纖':a13,
'網路':a14,
'寬頻':a15,
'磁卡':a16,
'椅':a17,
'桌':a18,
'書櫃':a19,
'沙發':a20,
'警報':a21,
'監視':a22,
'滅火':a23,
'監控':a24,
'警衛':a25,
'保全':a26,
'第四臺':a27,
'清掃':a28,
'垃圾':a29,
'公共區域':a30,
'公用區域':a31,
'公共空間':a32,
'公用空間':a33,
'資源回收':a34,
'乾溼分離':a35,
'烘乾機':a36,
'除濕機':a37,
'窗':a38,
'獨立門戶':a39,
'熱水壺':a40,
'飲水機':a41,
'電視':a42,
'通風':a43,
'採光':a44,
'光線充足':a45,
'梳妝台':a46,
'車位':a47,
'代收':a48,
'頂加':a49,
'鞋櫃':a50,
'社會住宅':a51,
'冰箱':a52,
})